tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/core"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# User interface to the TELNET protocol
brew "telnet"
# Application uninstaller
cask "appcleaner"
# Voice and text chat software
cask "discord"
# Web browser
cask "google-chrome"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Free and open source web app scanner
cask "zap"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "monosans.djlint"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.LiveServer"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscode-icons-team.vscode-icons"
